
## :x: Apply Failed

[CI link](https://github.com/mongulu-cm/mtchoun-mouh/actions/runs/7686400093)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
Running apply in the remote backend. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/tfc-mongulu-cm/mtchoun-mouh-lambda-layer/runs/run-k2CqNgDnjMR4k37S

Waiting for the plan to start...

Terraform v1.5.4
on linux_amd64
Initializing plugins and modules...
null_resource.lambda_layer: Refreshing state... [id=1832908050273765846]
data.archive_file.lambda_zip: Reading...
data.archive_file.lambda_zip: Read complete after 0s [id=7bcc5fd12730e607b2381296e9168868a8b71ac7]
aws_api_gateway_rest_api.api: Refreshing state... [id=o1e3qkz6f9]
data.aws_caller_identity.current: Reading...
data.aws_iam_role.role: Reading...
aws_dynamodb_table.Users: Refreshing state... [id=mtchoun-mouh-lambda-layer-Users]
aws_cloudwatch_event_rule.scheduler: Refreshing state... [id=mtchoun-mouh-lambda-layer-trigger_user_scan]
aws_dynamodb_table.Register: Refreshing state... [id=mtchoun-mouh-lambda-layer-Register]
aws_dynamodb_table.Link_table: Refreshing state... [id=mtchoun-mouh-lambda-layer-Link_table]
aws_s3_bucket.website: Refreshing state... [id=mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm]
aws_s3_bucket.images: Refreshing state... [id=mtchoun-mouh-lambda-layer-djansang]
data.aws_caller_identity.current: Read complete after 0s [id=053932140667]
data.aws_iam_role.role: Read complete after 0s [id=website-deployer]
aws_lambda_function.lambda: Refreshing state... [id=mtchoun-mouh-lambda-layer-user_registration_consulcam]
aws_lambda_function.scan: Refreshing state... [id=mtchoun-mouh-lambda-layer-scan_user_consulcam]
aws_api_gateway_resource.resource: Refreshing state... [id=rwxfg3]
aws_api_gateway_method.method: Refreshing state... [id=agm-o1e3qkz6f9-rwxfg3-POST]
module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-o1e3qkz6f9-rwxfg3-OPTIONS]
module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-o1e3qkz6f9-rwxfg3-OPTIONS-200]
module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-o1e3qkz6f9-rwxfg3-OPTIONS]
aws_api_gateway_method_response.method_response_200: Refreshing state... [id=agmr-o1e3qkz6f9-rwxfg3-POST-200]
aws_cloudwatch_event_target.target: Refreshing state... [id=mtchoun-mouh-lambda-layer-trigger_user_scan-lambda]
aws_lambda_permission.allow_cloudwatch_to_call_check_foo: Refreshing state... [id=AllowExecutionFromCloudWatch]
module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-o1e3qkz6f9-rwxfg3-OPTIONS-200]
aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_api_gateway_integration.integration: Refreshing state... [id=agi-o1e3qkz6f9-rwxfg3-POST]
aws_api_gateway_deployment.test: Refreshing state... [id=suutve]
local_file.index_page: Refreshing state... [id=98f455ae6da3a4cb9d87a96da07698b2dfcc0530]
aws_s3_bucket_public_access_block.website: Refreshing state... [id=mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm]
aws_s3_bucket_object.example_file: Refreshing state... [id=index.html]
aws_s3_bucket_policy.website: Refreshing state... [id=mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.archive_file.test_zip will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "test_zip" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "python.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "test_lambda_layer"
      + type                = "zip"
    }

  # aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "mtchoun-mouh-lambda-layer-user_registration_consulcam"
      ~ layers                         = [] -> (known after apply)
        tags                           = {
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.test_lambda_layer will be created
  + resource "aws_lambda_layer_version" "test_lambda_layer" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "python3.7",
          + "python3.8",
        ]
      + created_date                = (known after apply)
      + filename                    = "python.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "test_lambda_layer"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # aws_s3_bucket.images will be updated in-place
  ~ resource "aws_s3_bucket" "images" {
        id                          = "mtchoun-mouh-lambda-layer-djansang"
        tags                        = {
            "Name"        = "images"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (10 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.website will be updated in-place
  ~ resource "aws_s3_bucket" "website" {
        id                          = "mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm"
        tags                        = {
            "Name"        = "Website"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (12 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

        # (3 unchanged blocks hidden)
    }

  # local_file.index_page will be created
  + resource "local_file" "index_page" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../html/index.html"
      + id                   = (known after apply)
    }

  # null_resource.lambda_layer is tainted, so must be replaced
-/+ resource "null_resource" "lambda_layer" {
      ~ id       = "1832908050273765846" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 3 to change, 1 to destroy.


------------------------------------------------------------------------

Cost estimation:

Resources: 3 of 5 estimated
           $1.74096/mo +$0.0

------------------------------------------------------------------------

null_resource.lambda_layer: Destroying... [id=1832908050273765846]
null_resource.lambda_layer: Destruction complete after 0s
null_resource.lambda_layer: Creating...
null_resource.lambda_layer: Provisioning with 'local-exec'...
null_resource.lambda_layer (local-exec): Executing: ["/bin/sh" "-c" "        /bin/bash\n\n        python3 -m venv test_lambda_layer #Python is the name of de layer\n        soure python/bin/active\n        pip install -r api/requirements.txt -t python/lib/python3.8/site-pakages\n\n        #zip -r python.zip test_lambda_layer\n"]
null_resource.lambda_layer (local-exec): The virtual environment was not created successfully because ensurepip is not
null_resource.lambda_layer (local-exec): available.  On Debian/Ubuntu systems, you need to install the python3-venv
null_resource.lambda_layer (local-exec): package using the following command.

null_resource.lambda_layer (local-exec):     apt install python3.8-venv

null_resource.lambda_layer (local-exec): You may need to use sudo with that command.  After installing the python3-venv
null_resource.lambda_layer (local-exec): package, recreate your virtual environment.

null_resource.lambda_layer (local-exec): Failing command: ['/home/tfc-agent/.tfc-agent/component/terraform/runs/run-k2CqNgDnjMR4k37S/config/test_lambda_layer/bin/python3', '-Im', 'ensurepip', '--upgrade', '--default-pip']

null_resource.lambda_layer (local-exec): /bin/sh: 4: soure: not found
aws_lambda_layer_version.test_lambda_layer: Creating...
aws_s3_bucket.images: Modifying... [id=mtchoun-mouh-lambda-layer-djansang]
aws_s3_bucket.website: Modifying... [id=mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm]
local_file.index_page: Creating...
local_file.index_page: Creation complete after 0s [id=98f455ae6da3a4cb9d87a96da07698b2dfcc0530]
null_resource.lambda_layer (local-exec): Collecting beautifulsoup4==4.9.1
null_resource.lambda_layer (local-exec):   Downloading beautifulsoup4-4.9.1-py3-none-any.whl (115 kB)
null_resource.lambda_layer (local-exec): Collecting certifi==2022.12.7
null_resource.lambda_layer (local-exec):   Downloading certifi-2022.12.7-py3-none-any.whl (155 kB)
null_resource.lambda_layer (local-exec): Collecting chardet==3.0.4
null_resource.lambda_layer (local-exec):   Downloading chardet-3.0.4-py2.py3-none-any.whl (133 kB)
null_resource.lambda_layer (local-exec): Collecting idna==2.10
null_resource.lambda_layer (local-exec):   Downloading idna-2.10-py2.py3-none-any.whl (58 kB)
null_resource.lambda_layer (local-exec): Collecting requests==2.31.0
null_resource.lambda_layer (local-exec):   Downloading requests-2.31.0-py3-none-any.whl (62 kB)
null_resource.lambda_layer (local-exec): Collecting soupsieve==2.0.1
null_resource.lambda_layer (local-exec):   Downloading soupsieve-2.0.1-py3-none-any.whl (32 kB)
null_resource.lambda_layer (local-exec): Collecting zulip==0.8.2
null_resource.lambda_layer (local-exec):   Downloading zulip-0.8.2-py3-none-any.whl (273 kB)
null_resource.lambda_layer (local-exec): Collecting sentry-sdk==1.14.0
null_resource.lambda_layer (local-exec):   Downloading sentry_sdk-1.14.0-py2.py3-none-any.whl (178 kB)
null_resource.lambda_layer (local-exec): Collecting python-lambda==11.8.0
null_resource.lambda_layer (local-exec):   Downloading python_lambda-11.8.0-py3-none-any.whl (17 kB)
null_resource.lambda_layer (local-exec): Collecting charset-normalizer<4,>=2
null_resource.lambda_layer (local-exec):   Downloading charset_normalizer-3.3.2-cp38-cp38-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (141 kB)
null_resource.lambda_layer (local-exec): Collecting urllib3<3,>=1.21.1
null_resource.lambda_layer (local-exec):   Downloading urllib3-2.1.0-py3-none-any.whl (104 kB)
null_resource.lambda_layer (local-exec): Collecting matrix-client
null_resource.lambda_layer (local-exec):   Downloading matrix_client-0.4.0-py2.py3-none-any.whl (43 kB)
null_resource.lambda_layer (local-exec): Collecting distro
null_resource.lambda_layer (local-exec):   Downloading distro-1.9.0-py3-none-any.whl (20 kB)
null_resource.lambda_layer (local-exec): Collecting click
null_resource.lambda_layer (local-exec):   Downloading click-8.1.7-py3-none-any.whl (97 kB)
null_resource.lambda_layer (local-exec): Collecting typing-extensions>=3.7
null_resource.lambda_layer (local-exec):   Downloading typing_extensions-4.9.0-py3-none-any.whl (32 kB)
null_resource.lambda_layer (local-exec): Collecting PyYAML==5.1
null_resource.lambda_layer (local-exec):   Downloading PyYAML-5.1.tar.gz (274 kB)
null_resource.lambda_layer (local-exec): Collecting boto3>=1.4.4
null_resource.lambda_layer (local-exec):   Downloading boto3-1.34.29-py3-none-any.whl (139 kB)
null_resource.lambda_layer (local-exec): Collecting jmespath<2.0.0,>=0.7.1
null_resource.lambda_layer (local-exec):   Downloading jmespath-1.0.1-py3-none-any.whl (20 kB)
null_resource.lambda_layer (local-exec): Collecting s3transfer<0.11.0,>=0.10.0
null_resource.lambda_layer (local-exec):   Downloading s3transfer-0.10.0-py3-none-any.whl (82 kB)
null_resource.lambda_layer (local-exec): Collecting botocore<1.35.0,>=1.34.29
null_resource.lambda_layer (local-exec):   Downloading botocore-1.34.29-py3-none-any.whl (11.9 MB)
null_resource.lambda_layer (local-exec): Collecting python-dateutil<3.0.0,>=2.1
null_resource.lambda_layer (local-exec):   Downloading python_dateutil-2.8.2-py2.py3-none-any.whl (247 kB)
null_resource.lambda_layer (local-exec): Collecting six>=1.5
null_resource.lambda_layer (local-exec):   Downloading six-1.16.0-py2.py3-none-any.whl (11 kB)
null_resource.lambda_layer (local-exec): Building wheels for collected packages: PyYAML
null_resource.lambda_layer (local-exec):   Building wheel for PyYAML (setup.py): started
aws_s3_bucket.images: Modifications complete after 6s [id=mtchoun-mouh-lambda-layer-djansang]
null_resource.lambda_layer (local-exec):   Building wheel for PyYAML (setup.py): finished with status 'done'
null_resource.lambda_layer (local-exec):   Created wheel for PyYAML: filename=PyYAML-5.1-cp38-cp38-linux_x86_64.whl size=44072 sha256=6964439d0b10ff7eb46fb9cda9a625a1f27b8913d0661d8533477792461e1574
null_resource.lambda_layer (local-exec):   Stored in directory: /home/tfc-agent/.tfc-agent/component/terraform/runs/run-k2CqNgDnjMR4k37S/.cache/pip/wheels/52/dd/2b/10ff8b0ac81b93946bb5fb9e6749bae2dac246506c8774e6cf
null_resource.lambda_layer (local-exec): Successfully built PyYAML
null_resource.lambda_layer (local-exec): ERROR: matrix-client 0.4.0 has requirement urllib3~=1.21, but you'll have urllib3 2.1.0 which is incompatible.
null_resource.lambda_layer (local-exec): ERROR: botocore 1.34.29 has requirement urllib3<1.27,>=1.25.4; python_version < "3.10", but you'll have urllib3 2.1.0 which is incompatible.
null_resource.lambda_layer (local-exec): ERROR: python-lambda 11.8.0 has requirement click==6.6, but you'll have click 8.1.7 which is incompatible.
null_resource.lambda_layer (local-exec): Installing collected packages: soupsieve, beautifulsoup4, certifi, chardet, idna, charset-normalizer, urllib3, requests, matrix-client, distro, click, typing-extensions, zulip, sentry-sdk, PyYAML, jmespath, six, python-dateutil, botocore, s3transfer, boto3, python-lambda
aws_s3_bucket.website: Modifications complete after 6s [id=mtchoun-mouh-lambda-layer-mtchoun-mouh.mongulu.cm]
null_resource.lambda_layer: Still creating... [10s elapsed]
null_resource.lambda_layer (local-exec): Successfully installed PyYAML-5.1 beautifulsoup4-4.9.1 boto3-1.34.29 botocore-1.34.29 certifi-2022.12.7 chardet-3.0.4 charset-normalizer-3.3.2 click-8.1.7 distro-1.9.0 idna-2.10 jmespath-1.0.1 matrix-client-0.4.0 python-dateutil-2.8.2 python-lambda-11.8.0 requests-2.31.0 s3transfer-0.10.0 sentry-sdk-1.14.0 six-1.16.0 soupsieve-2.0.1 typing-extensions-4.9.0 urllib3-2.1.0 zulip-0.8.2
null_resource.lambda_layer: Creation complete after 17s [id=7799415462165625040]
data.archive_file.test_zip: Reading...
data.archive_file.test_zip: Read complete after 1s [id=c644155cd1b7739be796bea409fc80cb172706af]
╷
│ Error: Unable to load "python.zip": open python.zip: no such file or directory
│ 
│   with aws_lambda_layer_version.test_lambda_layer,
│   on main.tf line 188, in resource "aws_lambda_layer_version" "test_lambda_layer":
│  188: resource "aws_lambda_layer_version" "test_lambda_layer" {
│ 
╵
Operation failed: failed running terraform apply (exit 1)

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"deploy","PRNumber":144,"Program":"tfcmt","SHA1":"59c030c7f6cb2c14eb226b8ae6d5184b6b973bd9","Vars":{},"WorkflowName":"Deploy cases"} -->